linux_driver_code/deferring_mechanism/deferring_mechanism.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-22 一 21:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Work Deferring Mechanism</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yanqing Li" />
<link rel="stylesheet" type="text/css" href="../../style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Work Deferring Mechanism</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org65b5888">1. Tasklets</a>
<ul>
<li><a href="#orgf52cd8d">1.1. Declare</a></li>
<li><a href="#org8b652cd">1.2. Ealabing and disabling a tasklet</a></li>
<li><a href="#orge9349cd">1.3. Tasklet scheduling</a></li>
<li><a href="#org0ee2379">1.4. Example Code</a></li>
</ul>
</li>
<li><a href="#org2ba8a01">2. Work queues</a>
<ul>
<li><a href="#org236c289">2.1. Kernel-global workqueue - the shared queue</a>
<ul>
<li><a href="#orgf405969">2.1.1. Initialize the workqueue</a></li>
<li><a href="#org6ed2e89">2.1.2. Schedule the workqueue</a></li>
</ul>
</li>
<li><a href="#orgd766761">2.2. Dedicated work queue</a>
<ul>
<li><a href="#org1689cc2">2.2.1. Initialize our work queue and embed our work into:</a></li>
<li><a href="#orgaef0384">2.2.2. Scheduling work:</a></li>
<li><a href="#org532b140">2.2.3. Wait on all pending work on the given work queue:</a></li>
<li><a href="#orgebd5025">2.2.4. Cleanup:</a></li>
<li><a href="#org71fc136">2.2.5. Example Code</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
There are three deferring mechanism in the kernel:
</p>
<ul class="org-ul">
<li><b>SoftIRQs</b>: Executed in an atomic context</li>
<li><b>Tasklets</b>: Executed in an atomic context</li>
<li><b>Workueues</b>: Executed in a process context</li>
</ul>

<div id="outline-container-org65b5888" class="outline-2">
<h2 id="org65b5888"><span class="section-number-2">1</span> Tasklets</h2>
<div class="outline-text-2" id="text-1">
<p>
Tasklets are an instantiation of softirqs, and will be sufficient in almost every case that you feel the ned to use softirqs.
Tasklets are a bottom-half mechanism built on top of softirqs.
Tasklet can run on one and only one CPU simultaneously, which is the CPU it was scheduled on, but different tasklets may be run simultaneously
on different CPUs.
</p>

<p>
Tasklet are represented in the kernel as instances of struct tasklet_struct:
</p>
<pre class="example">
struct tasklet_struct
{
	struct tasklet_struct *next;
	unsigned long state;
	atomic_t count;
	void (*func)(unsigned long);
	unsigned long data;
};
</pre>
</div>

<div id="outline-container-orgf52cd8d" class="outline-3">
<h3 id="orgf52cd8d"><span class="section-number-3">1.1</span> Declare</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Dynamically:</li>
</ul>
<pre class="example">
void tasklet_init(struct tasklet_struct *t,
			 void (*func)(unsigned long), unsigned long data);
</pre>

<ul class="org-ul">
<li>Statically:</li>
</ul>
<pre class="example">
DECLARE_TASKLET(name, func, data);
DECLARE_TASKLET_DISABLED(name, func, data);
</pre>

<p>
There is one difference between above two functins, the former cteates a tasklet already enabled and ready to e scheduled without any other funciton call,
done by setting the count field to 0, whereas the latter creates a tasklet disabled(done by setting count to 1), on which one has to call tasklet_enable()
before the tasklet can be schedulable.
</p>
</div>
</div>

<div id="outline-container-org8b652cd" class="outline-3">
<h3 id="org8b652cd"><span class="section-number-3">1.2</span> Ealabing and disabling a tasklet</h3>
<div class="outline-text-3" id="text-1-2">
<p>
tasklet_enable() function is used to enable a tasklet:
</p>
<pre class="example">
void tasklet_enable(struct tasklet_struct *t);
</pre>

<p>
You can call tasklet_disable() function to disable a tasklet, and it will disable the tasklet and return only when the tasklet has terminated its execution(if it was running),
or call tasklet_disable_nosync returns immediately, even if the termination has not occured.
</p>
<pre class="example">
void tasklet_disable(struct tasklet_struct *t);
void tasklet_disable_nosync(struct tasklet_struct *t);
</pre>
</div>
</div>

<div id="outline-container-orge9349cd" class="outline-3">
<h3 id="orge9349cd"><span class="section-number-3">1.3</span> Tasklet scheduling</h3>
<div class="outline-text-3" id="text-1-3">
<p>
There are two scheduling functions for tasklet, depending on whther your tasklet has normal or higher priority:
</p>
<pre class="example">
void tasklet_schedule(struct tasklet_struct *t);
void tasklet_hi_schedule(struct tasklet_struct *t);
</pre>

<p>
The kernel maintains normal priority and high priority tasklets in two different lists.
tasklet_schedule adds the tasklet into the normal priority list, scheduling the associated softirq with a TASKLET_SOFTIRQ flag. With tasklet_hi__schedule,
the tasklet is added into the high priority list, scheduling the associated softirq with a HI_SOFTIRQ flag. High priority tasklets are meant to be used for
soft interrupt handlers with low latency requirements. There are some properties associated with tasklets you should know.
</p>

<ul class="org-ul">
<li>Calling tasklet_schedule on a tasklet already scheduled, but whose executions has not started, will do nothing, resulting in the tasklet being executed only once.</li>
<li>tasklet_schedule can be called in a tasklet, meaning that a tasklet can reschedule itself.</li>
<li>Hight prority tasks will increase the system latency. Only use them for really quick stuff.</li>
</ul>

<p>
You can stop a tasklet using the tasklet_kill function that wil prevent the tasklet from running again or wait for its completion before killing it if the tasklet is currently scheduled to run.
</p>
<pre class="example">
void tasklet_kill(struct tasklet_struct *t);
</pre>
</div>
</div>

<div id="outline-container-org0ee2379" class="outline-3">
<h3 id="org0ee2379"><span class="section-number-3">1.4</span> Example Code</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<a href="./src/tasklet.c">tasklet.c</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org2ba8a01" class="outline-2">
<h2 id="org2ba8a01"><span class="section-number-2">2</span> Work queues</h2>
<div class="outline-text-2" id="text-2">
<p>
There are two types of work queue, one is shared work queue, another is dedicated work queue, the shared work queue are handled by a set of kernel threads,
each running on a CPU. Once you have work to schedule, you queue that work into the global work queue, which will be executed at the appropriate moment.
The dedicated work queue run the work queue in a dedicated kernel thread. It means whenever your work queue handler needs to be executed, your kernel thread
is woken up to handle it, instead of one of the default predefined threads.
</p>
</div>

<div id="outline-container-org236c289" class="outline-3">
<h3 id="org236c289"><span class="section-number-3">2.1</span> Kernel-global workqueue - the shared queue</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgf405969" class="outline-4">
<h4 id="orgf405969"><span class="section-number-4">2.1.1</span> Initialize the workqueue</h4>
<div class="outline-text-4" id="text-2-1-1">
<pre class="example">
INIT_WORK(_work, _func);
</pre>
</div>
</div>

<div id="outline-container-org6ed2e89" class="outline-4">
<h4 id="org6ed2e89"><span class="section-number-4">2.1.2</span> Schedule the workqueue</h4>
<div class="outline-text-4" id="text-2-1-2">
<pre class="example">
bool schedule_work(struct work_struct *work);
bool schedule_delayed_work(struct delayed_work *dwork,
					 unsigned long delay);
bool schedule_work_on(int cpu, struct work_struct *work);
bool schedule_delayed_work_on(int cpu, struct delayed_work *dwork,
					    unsigned long delay);
</pre>

<p>
A work already submitted to the shared queue can be cancelled with the cancel_delayed_work function, You can flush the shared workqueue with:
</p>
<pre class="example">
void flush_scheduled_work(void);
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd766761" class="outline-3">
<h3 id="orgd766761"><span class="section-number-3">2.2</span> Dedicated work queue</h3>
<div class="outline-text-3" id="text-2-2">
<p>
There are four steps to scheduling your work in your own kernel thread:
</p>
<ul class="org-ul">
<li>Declare/initialize a struct workqueue_struct.</li>
<li>Create your work function.</li>
<li>Create a struct work_struct so that your work function will be embedded into it.</li>
<li>Embed your work function in the work_struct.</li>

<li>Declare work and work queue:</li>
</ul>
<pre class="example">
struct workqueue_struct *myqueue;
struct work_struct mywork;
</pre>

<ul class="org-ul">
<li>Define the worker function (the handler):</li>
</ul>
<pre class="example">
void dowork(void *data) { /* Code goes heae */ };
</pre>
</div>

<div id="outline-container-org1689cc2" class="outline-4">
<h4 id="org1689cc2"><span class="section-number-4">2.2.1</span> Initialize our work queue and embed our work into:</h4>
<div class="outline-text-4" id="text-2-2-1">
<pre class="example">
myqueue = create_singlethread_workqueue("mywork");
INIT_WORK( &amp;mywork, dowork, &lt;data-pointer&gt; );
</pre>
</div>
</div>

<div id="outline-container-orgaef0384" class="outline-4">
<h4 id="orgaef0384"><span class="section-number-4">2.2.2</span> Scheduling work:</h4>
<div class="outline-text-4" id="text-2-2-2">
<pre class="example">
queue_work(myqueue, &amp;mywork);
</pre>
<p>
Queue after the given  delay to the given worker thread:
</p>
<pre class="example">
queue_delayed_work(myqueue, &amp;mywork, &lt;delay&gt;);
</pre>
</div>
</div>

<div id="outline-container-org532b140" class="outline-4">
<h4 id="org532b140"><span class="section-number-4">2.2.3</span> Wait on all pending work on the given work queue:</h4>
<div class="outline-text-4" id="text-2-2-3">
<pre class="example">
void flush_workqueue(struct workqueue_struct *wq);
</pre>
<p>
flush_workqueue sleeps until all queued work has finished their execution.
</p>
</div>
</div>

<div id="outline-container-orgebd5025" class="outline-4">
<h4 id="orgebd5025"><span class="section-number-4">2.2.4</span> Cleanup:</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
Use cancle_work_sync() or cancel_delayed_work_sync for synchronous cancellation, which will cancel the work if it is not already running, or block until the work has completed.
The work will be cancelled even if it requeues itself.
</p>
<pre class="example">
bool cancel_work_sync(struct work_struct *work);
bool cancel_delayed_work_sync(struct delayed_work *dwork);
</pre>

<p>
cancel_work and cancel_delayed_work which are aynchronous forms of cancellation.
</p>
</div>
</div>

<div id="outline-container-org71fc136" class="outline-4">
<h4 id="org71fc136"><span class="section-number-4">2.2.5</span> Example Code</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
<a href="./src/work_queue.c">workqueue_example.c</a>
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yanqing Li</p>
<p class="date">Created: 2019-04-22 一 21:26</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
